import type { DocumentType } from "@/types";
const siteUrl = import.meta.env.SITE || "http://localhost:4321";
const email = "olgaserdiukwork@gmail.com";

export const privacyPolicyText: DocumentType = {
  title: "Політика конфіденційності та обробки персональних даних",
  subtitle: [
    {
      paragraph: [{ type: "text", text: "Ольга Сердюк в особі Ольги Сердюк" }],
    },
  ],
  date: "01 серпня 2025 року",
  points: [
    {
      title: "Загальні положення",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Цю Політику обробки персональних даних складено відповідно до вимог Закону України «Про персональні дані» та визначає порядок обробки персональних даних та заходи щодо забезпечення безпеки персональних даних і вона набирає чинності з моменту публікації на сайті, дата публікації вказана в кінці документу.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Ольга Сердюк» (далі – Оператор). Оператор ставить своєю найважливішою метою та умовою здійснення своєї діяльності дотримання прав і свобод людини та громадянина при обробці персональних даних відвідувачів сайту, у тому числі захисту прав на недоторканність приватного життя.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Ця політика Оператора щодо обробки персональних даних (далі – Політика) застосовується до всієї інформації, яку Оператор може отримати про відвідувачів веб-сайту ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
      ],
    },
    {
      title: "Основні поняття, що використовуються у Політиці",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Автоматизована обробка персональних даних – обробка персональних даних за допомогою обчислювальної техніки;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Блокування персональних даних – тимчасове припинення обробки персональних даних (крім випадків, якщо обробка необхідна для уточнення персональних даних);",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Веб-сайт – сукупність графічних та інформаційних матеріалів, а також програм для ЕОМ та баз даних, що забезпечують їх доступність у мережі інтернет за адресою ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Інформаційна система персональних даних – сукупність персональних даних, що містяться в базах даних, що забезпечує їх обробку за допомогою інформаційних технологій і технічних засобів;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Знеособлення персональних даних — дії, у яких неможливо визначити без використання додаткової інформації належність персональних даних конкретному Користувачеві чи іншому суб’єкту персональних даних;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Обробка персональних даних – будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи збирання, запис, систематизацію, накопичення, зберігання, уточнення (оновлення, зміну), вилучення, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Оператор – юридична або фізична особа, які самостійно або спільно з іншими особами організовують та (або) здійснюють обробку персональних даних, а також визначають цілі обробки персональних даних, склад персональних даних, що підлягають обробці, дії (операції), що здійснюються із персональними даними;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Персональні дані – будь-яка інформація, що стосується прямо або опосередковано до певного або визначеного Користувачеві веб-сайту ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Користувач – будь-який відвідувач веб-сайту ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ", який залишає на сайті свої персональні дані;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Надання персональних даних – дії, створені задля розкриття персональних даних певному особі чи певному колу осіб;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Поширення персональних даних – будь-які дії, спрямовані на розкриття персональних даних невизначеному колу осіб (передача персональних даних) або на ознайомлення з персональними даними необмеженого кола осіб, у тому числі оприлюднення персональних даних у засобах масової інформації, розміщення в інформаційно-телекомунікаційних мережах або надання доступу до персональних даних будь-яким іншим способом;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Транскордонна передача персональних даних – передача персональних даних на територію іноземної держави до органу влади іноземної держави, іноземної фізичної чи іноземної юридичної особи;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Знищення персональних даних – будь-які дії, внаслідок яких персональні дані знищуються безповоротно з неможливістю подальшого відновлення змісту персональних даних в інформаційній системі персональних даних та (або) внаслідок яких знищуються матеріальні носії персональних даних.",
            },
          ],
        },
      ],
    },
    {
      title: "Оператор може обробляти такі персональні дані Користувача:",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Прізвище, ім’я;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Електронна адреса;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Текст повідомлення;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Інші дані, добровільно надані Користувачем.",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Також на сайті відбувається збір та обробка знеособлених даних про відвідувачів (в т.ч. файлів cookie) за допомогою сервісів інтернет-статистики (Google Аналітика та інших).",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Дані за текстом Політики об’єднані загальним поняттям Персональні дані.",
            },
          ],
        },
      ],
    },
    {
      title: "Цілі обробки персональних даних",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Мета обробки персональних даних Користувача – інформування Користувача за допомогою надсилання електронних листів; надання доступу Користувачеві до сервісів, інформації та/або матеріалів, що містяться на веб-сайті ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Знеособлені дані Користувачів, які збираються за допомогою сервісів інтернет-статистики, служать для збору інформації про дії Користувачів на сайті, покращення якості сайту та його змісту.",
            },
          ],
        },
      ],
    },
    {
      title: "Правові основи обробки персональних даних",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Оператор обробляє персональні дані Користувача лише у разі їх заповнення та/або відправлення Користувачем самостійно через спеціальні форми, розміщені на сайті ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ". Заповнюючи відповідні форми та/або надсилаючи свої персональні дані Оператору, Користувач висловлює свою згоду з цією Політикою.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Оператор обробляє знеособлені дані про Користувача у випадку, якщо це дозволено у налаштуваннях браузера Користувача (включено збереження файлів cookie та використання технології JavaScript).",
            },
          ],
        },
      ],
    },
    {
      title: "Порядок збирання, зберігання, передачі та інших видів обробки персональних даних",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Безпека персональних даних, що обробляються Оператором, забезпечується шляхом реалізації правових, організаційних та технічних заходів, необхідних для виконання в повному обсязі вимог чинного законодавства в галузі захисту персональних даних осіб.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Персональні дані Користувача ніколи, за жодних умов не будуть передані третім особам, за винятком випадків, пов’язаних із виконанням чинного законодавства.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "У разі виявлення неточностей у персональних даних, Користувач може актуалізувати їх самостійно відписавшись від розсилки повідомлень і  підписатися знову з новими даними.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Щоб подати запит на видалення персональних даних, Користувач повинен надіслати листа на ",
            },
            {
              type: "email",
              text: email,
              to: email,
            },
            {
              type: "text",
              text: ' із темою "Запит на видалення персональних даних" та вказати у повідомленні такі дані:',
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Ім’я (яке було вказано).",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Електронну адресу, яку Користувач вказував при заповненні форми",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: 'Чітке прохання видалити персональні дані (наприклад, "Прошу видалити моє ім\'я та електронну адресу з вашої системи").',
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Ми опрацюємо запит та повідомимо про результати.",
            },
          ],
        },
      ],
    },
    {
      title: "Транскордонна передача персональних даних",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Оператор на початок здійснення транскордонної передачі персональних даних зобов’язаний переконатися у цьому, що іноземним державою, територію якого передбачається здійснювати передачу персональних даних, забезпечується надійний захист прав суб’єктів персональних даних.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Транскордонна передача персональних даних на території іноземних держав, які не відповідають вищевказаним вимогам, може здійснюватися лише у разі наявності згоди у письмовій формі суб’єкта персональних даних на транскордонну передачу його персональних даних та/або виконання договору, стороною якого є суб’єкт персональних даних.",
            },
          ],
        },
      ],
    },
    {
      title: "Заключні положення",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Користувач може отримати будь-які роз’яснення щодо питань, що його цікавлять стосовно обробки персональних даних, звернувшись до Оператора за допомогою електронної пошти ",
            },
            {
              type: "email",
              text: email,
              to: email,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "У цьому документі буде відображено будь-які зміни політики обробки персональних даних Оператором. Політика діє безстроково до заміни її новою версією. Дата публікації оновленої версії буде вказана на початку документу.",
            },
          ],
        },
      ],
    },
  ],
};
