import { DocumentType } from "@/types";

const siteUrl = import.meta.env.SITE || "http://localhost:4321";
const email = "olgaserdiukwork@gmail.com";

export const publicOferta: DocumentType = {
  title: "ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ",
  date: "від 01.08.2025",
  subtitle: [
    {
      paragraph: [
        {
          type: "text",
          text: "Ольга Сердюк (далі«Виконавець») в особі Ольги Сердюк з одного боку і користувач, який акцептував оферту, постійно розміщену в мережі Інтернет за мережевою адресою ",
        },
        {
          type: "link",
          text: siteUrl,
          to: siteUrl,
        },
        {
          type: "text",
          text: ", користувач сайту ",
        },
        {
          type: "link",
          text: siteUrl,
          to: siteUrl,
        },
        {
          type: "text",
          text: " у мережі Інтернет, уклали цей договір на реалізацію інформаційного – консультаційного продукту на умовах, викладених нижче.",
        },
      ],
    },
  ],
  points: [
    {
      title: "ТЕРМІНИ І ВИЗНАЧЕННЯ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Основні поняття та визначення термінів, що вживаються в Договорі:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Договір» - договір на реалізацію інформаційно - консультаційних послуг.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Виконавець» - Ольга Сердюк.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Замовник» - будь-яка дієздатна фізична особа, індивідуальний підприємець або юридична особа, яка здійснила акцепт цієї публічної оферти.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Послуги» - інформаційно-консультаційні послуги у сфері кар'єрного розвитку та особистого коучінгу, перелік (види, умови, вартість) яких визначені на сайті Виконавця ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ", який відкритий для публічного ознайомлення та вільного доступу Замовника. Послуга може передбачати можливість здійснення зворотного зв’язку з особою, яка надає інформаційно-консультаційні послуги.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Об’єкт реалізації» - інформаційно-консультаційні послуги в сфері кар'єрного розвитку, менторингу та особистісного коучингу, зокрема: первинні консультації, індивідуальні програми супроводу та онлайн-підтримку, консультації фізичних та юридичних осіб з питань побудови бізнесу та оптимізації.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Споживач» - фізична особа, участь якої в навчальних програмах, менторинг сесіях та консультаціях оплачена Замовником. Виконавець надає Послуги, передбачені предметом цього Договору.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Сайт» - вебсайт Виконавця ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Замовлення» - оформлений Замовником запит на отримання інформаційно-консультаційних послуг Замовником.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Сторони» - Виконавець та Замовник.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "«Акцепт (прийняття пропозиції)» – повне й безумовне прийняття Замовником умов Публічної оферти (пропозиції), викладених в цьому Договорі, шляхом заповнення відповідної заявки (форми) на інтернет-сторінці Виконавця та/або сплата 100% вартості послуг. Договір, укладений Замовником за допомогою акцепту публічної оферти є чинним відповідно до ст. 642 Цивільного кодексу України і прирівнюється до договору, укладеному Сторонами у письмовій формі. При поданні заявки (заповнення необхідної форми) та/або здійснення повної чи часткової оплати Замовник вважається таким, що ознайомлений та згоден з умовами цієї публічної оферти.",
            },
          ],
        },
      ],
    },
    {
      title: "ПРЕДМЕТ ОФЕРТИ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "2.1. Предметом цієї Оферти є надання Замовнику інформаційно-консультаційних послуг відповідно до пп. 2.1.1. Оферти.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "2.1.1. Інформаційно-консультаційні послуги включають проведення онлайн консультації, менторські та коучингові сесії та навчальні матеріали до них. Повний перелік послуг міститься в Додатку до Оферта.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "2.2. Замовник, акцептуючи Договір та додаток до нього, підтверджує, що надає персональні дані Споживача за його згодою. Виконавець не несе відповідальності у разі незаконної передачі Замовником персональних даних третьої особи.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "2.3. Виконавець має право в будь-який момент змінювати зміст матеріалів та умови цієї публічної Оферти в односторонньому порядку без попереднього погодження із Замовником, забезпечуючи при цьому публікацію змінених умов на сайті ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
      ],
    },
    {
      title: "АКЦЕПТУВАННЯ ДОГОВОРУ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "3.1. Цей договір є публічною офертою Виконавця і містить усі істотні умови договору надання інформаційно-консультаційних послуг.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "3.2. Акцептом цієї публічної оферти є здійснення запису на первинну консультацію через сайт, електронну пошту, соціальні мережі або форму зворотного зв'язку на сайт ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ". З моменту надходження запиту на надання послуг Замовнику Виконавцем, цей договір вважається укладеним між Замовником та Виконавцем.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "3.3.  Замовник може самостійно у будь-який момент ознайомитись із умовами Договору на сайті Виконавця та зобов’язаний відслідковувати інформацію із сайту самостійно перед оформленням кожної наступної заявки на Послуги, зокрема, з метою ознайомлення із важливою інформацією, яка може періодично вноситись Виконавцем.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "3.4. Після первинної консультації Виконавець і Замовник за згодою сторін можуть домовитися про індивідуальну програму співпраці.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "3.5. Детальні умови (тривалість, обсяг, вартість, спосіб оплати) узгоджуються окремо та фіксуються в індивідуальному договорі або в електронному листуванні.",
            },
          ],
        },
      ],
    },
    {
      title: "ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "4.1. Виконавець зобов’язується:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.1.1. надавати Замовнику Послуги згідно з умовами цього Договору.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.1.2. зберігати конфіденційну інформацію, отриману від Замовника, при наданні інформаційно-консультаційних послуг за цим договором;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.1.3. дотримуватись вимог законодавства, що стосуються обробки, передачі та захисту персональних даних Замовника.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.2. Виконавець має право:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.2.1. вимагати від Замовника належного та повного виконання взятих на себе зобов’язань за цим Договором.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.2.2. відмовитися від надання послуг Замовнику, який надав Виконавцю недостовірні дані, а також Замовнику, який порушує п. 5.2. Оферти;",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.3. Замовник зобов’язується:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.3.1. належним чином виконувати взяті на себе зобов’язання за цим Договором.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.3.2. прийняти та оплатити надані Виконавцем послуги в порядку та на умовах визначеними цим Договором.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.4. Замовник має право:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.4.1. Отримати послуги на умовах та в порядку передбаченими даним Договором.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "4.4.2. звернутися до Виконавця з письмовою заявою про перенесення строків надання оплачених послуг за цим договором із додатком підтверджуючих неможливість отримання послуг документів: довідки про перебування у стаціонарі, про стихійних лих, а також інших подій, які унеможливлюють отримання Замовником послуг, передбачених цим договором.",
            },
          ],
        },
      ],
    },
    {
      title: "ВАРТІСТЬ ПОСЛУГ І ПОРЯДОК ОПЛАТИ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "5.1. Вартість інформаційно-консультаційних послуг за Договором зазначена на сторінці ",
            },
            {
              type: "link",
              text: siteUrl,
              to: siteUrl,
            },
            {
              type: "text",
              text: ".",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "5.2. Оплата обраної послуги проводиться Замовником шляхом зарахування грошових коштів у порядку 100% передоплати, шляхом використання одного із запропонованих Виконавцем способів оплати.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "5.3. Відсутність вимоги щодо повернення коштів відповідно до розділу 7 цього Договору, означає, що послуги надані у строк та належної якості.",
            },
          ],
        },
      ],
    },
    {
      title: "ОСОБЛИВІ УМОВИ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "6.1. Послуги, передбачені цим Договором, надаються Виконавцем особисто Замовнику та вказаним ним Споживачам. Замовнику забороняється передавати реквізити доступу до ресурсу для отримання інформаційно-консультаційних послуг третім особам, а також спільне з третіми особами надання послуг без спеціального дозволу Виконавця.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "6.2. Виконавець не несе відповідальності за неможливість надання послуг Замовнику з причин, які не залежать від Виконавця, а саме: порушення роботи Інтернет-каналу, обладнання або програмного забезпечення з боку Замовника.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "6.5. Інформаційно-консультаційні послуги, що надаються Виконавцем згідно цього Договору не є освітніми послугами, що підлягають обов’язковому ліцензуванню. Надання Послуг не супроводжується підсумковою атестацією та видачею документів про освіту.",
            },
          ],
        },
      ],
    },
    {
      title: "УМОВИ І ПОРЯДОК ПОВЕРНЕННЯ ГРОШОВИХ ЗАСОБІВ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "7.1. Замовник має право на подання заявки на повернення коштів у строк не більше 5 (п’яти) днів з дати останньої проведеної консультації в межах сплаченого пакету Послуг. Заявка на повернення подається у письмовій формі на електронну адресу Виконавця (вказати електронну адресу) з темою листа “Refund”.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.2. Повернення коштів можливе лише за ті консультації (сесії), які ще не були надані Виконавцем на момент отримання Виконавцем письмової заявки на повернення. Розрахунок повернення здійснюється виходячи з фактично наданих консультацій за базовою вартістю однієї індивідуальної сесії, що становить 1200 грн за 1 сесію, незалежно від того, за яким пакетом були придбані послуги.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Приклад: Якщо Замовник оплатив пакет з 5 сесій за 5200 грн і використав 3 сесії, то при розірванні договору йому повертається сума, що залишилася після вирахування вартості 3 сесій за розрахунковою ціною 1200 грн за кожну (тобто 5200 - 3600 = 1600 грн).",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.3. До заявки обов’язково додаються наступні документи:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Для фізичних осіб та індивідуальних підприємців:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Заява із зазначенням причини повернення та згодою з умовами розрахунку;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Копія паспорта Замовника (для ідентифікації особи);",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Докази оплати послуг.",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Для юридичних осіб:",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Заява із зазначенням причини повернення та згодою з умовами розрахунку;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "ІПН, ЄДРПОУ (для громадян України);",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Копія паспорта директора;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Наказ про призначення директора;",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Докази оплати послуг.",
              sublist: true,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.4. Консультація вважається наданою і підлягає оплаті, якщо Замовник не повідомив про її скасування мінімум за 8 (вісім) годин до запланованого часу проведення або не з’явився на консультацію без попередження. У такому випадку сесія вважається проведеною, і кошти за неї поверненню не підлягають.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.5. Заявка Замовника розглядається Виконавцем протягом 10 (десяти) робочих днів з дати її отримання. Повернення коштів здійснюється протягом 10 (десяти) робочих днів з дати прийняття позитивного рішення щодо повернення.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.6. Замовник, якому було здійснено повернення частини коштів, втрачає право на отримання будь-яких подальших Послуг за цим договором.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "7.7. Виконавець не несе відповідальності за невідповідність Послуг очікуванням Замовника та/або його суб’єктивною оцінкою. Такі обставини не є підставою для визнання Послуг неякісними чи ненаданими.",
            },
          ],
        },
      ],
    },
    {
      title: "ЗАКЛЮЧНІ ПОЛОЖЕННЯ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "8.1. Цей договір набирає чинності з моменту акцепту Замовника відповідно із п. 3.2. договору та діє до виконання зобов’язань сторонами.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "8.2. Усі суперечки та розбіжності між сторонами вирішуються шляхом переговорів.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "8.3. Сторони встановили необхідність дотримання обов’язкового досудового претензійного порядку до звернення до суду Строк відповіді на претензію становить 30 (тридцять) календарних днів із дати отримання претензії.",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "8.4. Усі питання, не врегульовані Офертою, вирішуються відповідно до чинного законодавства України.",
            },
          ],
        },
      ],
    },
    {
      title: "РЕКВІЗИТИ ВИКОНАВЦЯ",
      content: [
        {
          paragraph: [
            {
              type: "text",
              text: "Контактні дані: ",
            },
            {
              type: "link",
              text: "https://t.me/Olga_Serdiuk_0",
              to: "https://t.me/Olga_Serdiuk_0",
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "E-mail: ",
            },
            {
              type: "email",
              text: email,
              to: email,
            },
          ],
        },
        {
          paragraph: [
            {
              type: "text",
              text: "Ольга Сердюк",
            },
          ],
        },
      ],
    },
  ],
};
